testing/2020-11-28_02-43-09.812544/bt.yaml
execution:
- executor: locust
  concurrency: 100
  ramp-up: 10s
  iterations: 1
  scenario: example

scenarios:
  example:
    default-address: http://127.0.0.1
    script: gatekeeper.py

modules:
  blazemeter:
    token: 66efeca3dc387cb78a89f34d:1182f7ca66965f39aba34faa013ffbf34b272e67ed3b4531568c21bbda28febf3926e8da

reporting:
- module: console
- module: final-stats
  summary: true
  percentiles: true 
  failed-labels: false
  test-duration: true
  dump-csv: TaurusResult/perf_result_csv.csv
- module: junit-xml
  data-source: pass-fail
  filename: TaurusResult/junit-result.xml
- module: blazemeter
  report-name: Taurus test report
  test: Taurus test
  project: Taurus test project